# OverrideGraphicSettings Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
OverrideGraphicSettings Properties
OverrideGraphicSettings Class See Also
---
The OverrideGraphicSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CutBackgroundPatternColor | The override color of the background pattern of cut faces. |
| CutBackgroundPatternId | The ElementId of the cut face background fill pattern override. A value of InvalidElementId means no override is set. |
| CutForegroundPatternColor | The override color of the foreground pattern of cut faces. |
| CutForegroundPatternId | The ElementId of the cut face foreground fill pattern override. A value of InvalidElementId means no override is set. |
| CutLineColor | Cut surface line color. |
| CutLinePatternId | ElementId of the cut surface line pattern. |
| CutLineWeight | Cut surface line weight. |
| DetailLevel | The detail level. |
| Halftone | Value of the halftone override. |
| InvalidPenNumber | The invalidPenNumber for clearing line weight overrides. |
| IsCutBackgroundPatternVisible | The visibility of the cut face background fill pattern. |
| IsCutForegroundPatternVisible | The visibility of the cut face foreground fill pattern. |
| IsSurfaceBackgroundPatternVisible | The visibility of the surface background fill pattern. |
| IsSurfaceForegroundPatternVisible | The visibility of the surface foreground fill pattern. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ProjectionLineColor | Projection surface line color. |
| ProjectionLinePatternId | Id of the projection surface line pattern. |
| ProjectionLineWeight | The projection surface line weight. |
| SurfaceBackgroundPatternColor | The override color of the surface background pattern. |
| SurfaceBackgroundPatternId | The ElementId of the surface background fill pattern override. A value of InvalidElementId means no override is set. |
| SurfaceForegroundPatternColor | The override color of the surface foreground pattern. |
| SurfaceForegroundPatternId | The ElementId of the surface foreground fill pattern override. A value of InvalidElementId means no override is set. |
| Transparency | Transparency of surfaces. |

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace